
#### Terraform Plan

```Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform/app_environment relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/cms/cms/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/cms/cms

To view this run in a browser, visit:
https://app.terraform.io/app/owenbendavies/cms-production/runs/run-nMHn9x4ivqJ2muBo

Waiting for the plan to start...

Terraform v0.12.28
Configuring remote state backend...
Initializing Terraform configuration...
2020/07/21 15:57:30 [DEBUG] Using modified User-Agent: Terraform/0.12.28 TFC/9ebf03fc0c
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.aws_s3.data.aws_caller_identity.main: Refreshing state...
module.aws_iam.data.aws_iam_policy_document.ses: Refreshing state...
module.aws_cloudfront.data.aws_caller_identity.main: Refreshing state...
module.aws_cloudfront.aws_cloudfront_origin_access_identity.assets: Refreshing state... [id=E140SVLNNNN5UD]
module.aws_cognito.aws_cognito_user_pool.app: Refreshing state... [id=eu-west-1_s5JVuLde6]
module.aws_iam.aws_iam_user.app: Refreshing state... [id=obduk-cms-production]
module.aws_s3.aws_s3_bucket.logs: Refreshing state... [id=obduk-cms-production-logs]
module.aws_iam.aws_iam_user_policy.app_ses: Refreshing state... [id=obduk-cms-production:ses]
module.aws_iam.aws_iam_access_key.app: Refreshing state... [id=AKIAJWMLZLF4OQASWROQ]
module.aws_cognito.aws_cognito_user_group.admin: Refreshing state... [id=eu-west-1_s5JVuLde6/admin]
module.aws_cognito.aws_cognito_user_pool_domain.app: Refreshing state... [id=obduk-cms-production]
module.aws_iam.data.aws_iam_policy_document.cognito: Refreshing state...
module.aws_cognito.aws_cognito_user_group.domains["obduk-cms-production.herokuapp.com"]: Refreshing state... [id=eu-west-1_s5JVuLde6/obduk-cms-production.herokuapp.com]
module.aws_cognito.aws_cognito_user_group.domains["www.spencerdown.com"]: Refreshing state... [id=eu-west-1_s5JVuLde6/www.spencerdown.com]
module.aws_cognito.aws_cognito_user_group.domains["www.docklandssinfonia.co.uk"]: Refreshing state... [id=eu-west-1_s5JVuLde6/www.docklandssinfonia.co.uk]
module.aws_iam.aws_iam_user_policy.app_cognito: Refreshing state... [id=obduk-cms-production:cognito]
module.aws_cognito.aws_cognito_user_pool_client.app: Refreshing state... [id=3d9q3crsvrs5lsffg3u4b28jk6]
module.aws_s3.aws_s3_bucket_public_access_block.logs: Refreshing state... [id=obduk-cms-production-logs]
module.aws_s3.aws_s3_bucket.assets: Refreshing state... [id=obduk-cms-production]
module.aws_s3.data.aws_iam_policy_document.assets: Refreshing state...
module.aws_iam.data.aws_iam_policy_document.s3: Refreshing state...
module.aws_s3.aws_s3_bucket_public_access_block.assets: Refreshing state... [id=obduk-cms-production]
module.aws_cloudfront.aws_cloudfront_distribution.assets: Refreshing state... [id=E1FNM6XTUMJ818]
module.aws_iam.aws_iam_user_policy.app_s3: Refreshing state... [id=obduk-cms-production:s3]
module.aws_s3.aws_s3_bucket_policy.assets: Refreshing state... [id=obduk-cms-production]
module.heroku.heroku_app.app: Refreshing state... [id=obduk-cms-production]
module.heroku.heroku_app_feature.app_log_runtime_metrics: Refreshing state... [id=obduk-cms-production:log-runtime-metrics]
module.heroku.heroku_formation.app_worker: Refreshing state... [id=8496e6ab-4183-4b74-bf7d-0232ffa3215a]
module.heroku.heroku_formation.app_web: Refreshing state... [id=02b822b3-6c4d-4231-ba50-26b479dafa02]
module.heroku.heroku_addon.app_rollbar: Refreshing state... [id=rollbar-globular-7617]
module.heroku.heroku_app_feature.api_runtime_dyno_metadata: Refreshing state... [id=obduk-cms-production:33146ed7-199e-4a8a-b648-08fd0b52e10d]
module.heroku.heroku_addon.app_scheduler: Refreshing state... [id=scheduler-polished-75678]
module.heroku.heroku_domain.app["www.docklandssinfonia.co.uk"]: Refreshing state... [id=4fce9edf-ea13-497c-9a2f-6c0b8d35e7ff]
module.heroku.heroku_domain.app["www.spencerdown.com"]: Refreshing state... [id=923c700c-c59b-43dc-ab56-369519047276]
module.heroku.heroku_addon.app_librato: Refreshing state... [id=librato-tapered-93550]
module.heroku.heroku_addon.app_logentries: Refreshing state... [id=81f2f48e-954c-4b26-81b9-3f2ce0a24dda]
module.heroku.heroku_addon.app_scout: Refreshing state... [id=bb6ba86c-4a26-4135-b542-21d38b0bd722]
module.heroku.heroku_addon.app_postgresql: Refreshing state... [id=postgresql-concentric-16775]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws_iam.data.aws_iam_policy_document.sqs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sqs"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:ChangeMessageVisibility",
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:GetQueueUrl",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.aws_iam.aws_iam_user_policy.app_sqs will be created
  + resource "aws_iam_user_policy" "app_sqs" {
      + id     = (known after apply)
      + name   = "sqs"
      + policy = (known after apply)
      + user   = "obduk-cms-production"
    }

  # module.aws_sqs_default.aws_sqs_queue.main will be created
  + resource "aws_sqs_queue" "main" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "obduk-cms-production-default"
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + tags                              = {
          + "environment" = "production"
          + "project"     = "cms"
        }
      + visibility_timeout_seconds        = 30
    }

  # module.aws_sqs_mailers.aws_sqs_queue.main will be created
  + resource "aws_sqs_queue" "main" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "obduk-cms-production-mailers"
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + tags                              = {
          + "environment" = "production"
          + "project"     = "cms"
        }
      + visibility_timeout_seconds        = 30
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
